{"intents": [
        {"tag": "Intro",
         "patterns": ["hi", 
                      "Hiiiiiii",
                      "yor name", 
                      "is anyone there", 
                      "hello", 
                      "whats up",
                      "hey",
                      "What is your name?", 
                      "please help me",
                      "your intro",
                      "yor name plese",
                      "who are you"],
         "responses": ["Hellooo Welcome to LoGMIEER's Campus I am your assistant I am Help in enquiry about admission process and college How can I Help You?"],
         "context_set": ""
        },
        {"tag": "Exit",
         "patterns": ["thank you", 
                      "thanks", 
                      "cya",
                      "see you",
                      "later", 
                      "see you later", 
                      "goodbye", 
                      "i am leaving", 
                      "have a Good day",
                      "you helped me",
                      "thanks a lot",
                      "thanks a ton",
                      "you are the best",
                      "great help",
                      "too good",
                      "you are a good learning buddy"],
         "responses": ["Thank You... I hope I was able to assist you, Bye"],
         "context_set": ""
        },
        {"tag": "College Name",
         "patterns": ["college name",
                      "full name of college",
                      "colej name",
                      "college intro",
                      "college of engineering name",
                      "neme of institute",
                      "engineering institute name",
                      "college name and organiuzation name",
                      "name of institute with organization ",
                      "what is name of college?",
                      "what is name of institute",
                      "insti name",
                      "name of organization",
                      "institute intro"],
         "responses": ["Krantiveer Vasantrao Narayanrao Naik Shikshan Prasarak Sanstha's Loknete Gopinathji Mundhe Instaitute of Engioneering Education And Research Center, Nashik"],
         "context_set": ""
        },
        {"tag": "Available Cources",
         "patterns": ["Which Cources are available in this college", 
                      "engineering cource",
                      "engineering cources offered by college",
                      "engineering cource available in institute",
                      "cource offered by college in technical sector",
                      "institute offers the which cource",
                      "In which field college offers the cource to students after twelth science",
                      "cource available after tweloth science with Math Group",
                      "after PCM group cources available"],
         "responses": ["Institute Currently Offers Total Five Cources which are Computer Science Engineering, AIML, Civil Engineering, Mechanical Engineering, Electrical Engineering.. with an intake capacity of sixty students in each, totaling three hundred plus."],
         "context_set": ""
        },
      
    {"tag": "Organization Body",
         "patterns": ["who is the president of kvn Naik Sansthas",
                      "organization president",
                      "adhakysha",
                      "kvn president", 
                      "Krantiveer Vasantrao Narayanrao Naik Shikshan Prasarak Sanstha's president", 
                      "org president"
                      ],
         "responses": ["Mr. Pandharinathji Thore Saheb"],
         "context_set": ""
        },
    
        {"tag": "Review to bot",
         "patterns": ["my problem is not solved", 
                      "you did not help me", 
                      "not a good solution",
                      "bad solution",
                      "not good solution",
                      "no help",
                      "wasted my time",
                      "useless bot",
                      "create a ticket"],
         "responses": ["Sorry... I will try it next time"],
         "context_set": ""
        },

        {"tag": "Vision",
        "patterns": ["vision of college",
                     "what is college vision",
                     "vsion mission",
                     "college vision vision about educatiion and student",
                     "vision of colege",
                     "vison of logmieerr",
                     "kvn naiikn vision",
                     "loknete gopinathji mundhe clj vision"],
        "responses": ["Provide Academic and Technical Excellence to all Classes of Society for Socio-Economic Development of the Region."],
        "context_set": ""
       },
       {"tag": "Mission",
        "patterns": ["mission of college",
                     "what is college mission",
                     "clj mission",
                     "clg mission",
                     "college mission abutv educatiion and student ,institute",
                     "mission of colege"],
        "responses": ["Provide infrastructure with all modern facilities with stress free and productive academic environment for teaching and learning, strategic extension, field action and advocacy through training and capacity building for students & faculty."],
        "context_set": ""
       },
       {"tag": "Principal",
       "patterns": ["who is Principal of college",
                    "who is Engineering principal",
                    "Logmieer Principal",
                    "clg principal",
                    "principal sir name",
                    "who is institute principal",
                    "principal"],
       "responses": ["Dr.K.V. Chandratre Sir is the Principal of College.."],
       "context_set": ""
       },
       {"tag": "Placement",
       "patterns": ["What is the status of campus placements?",
                    "Placements, placement ratio",
                    "campus drive",
                    "college placement staus or ratio",
                    "what is the average number of companies visiting the college every year.",
                    "What is the placement ratio",
                    "ration of placement drive",
                    "how many students are placed in last year"],
       "responses": ["The Campus placement rate recorded of LoGMIEER was 60 percent at previous year"],
       "context_set": ""
       },

       {"tag": "College Campus",
       "patterns": ["How is the campus of your college?",
                    "Environment of college",
                    "How is the logmieers Campus",
                    "clg campus how",
                    "College Infrastructure",
                    "clj campus",
                    "Infrastrcture of logmieer"],
       "responses": ["The institute has developed mostly in all the dimensions in a very short span of time. It has well equipped laboratories as per new syllabus of University of Pune. It furnished with modern furniture and teaching learning mechanisms. The spacious & well ventilated classrooms, laboratory halls, wide corridors, mega size modern passenger lifts, seminar halls for each department are some of the main features of the infrastructure of institute."],
       "context_set": ""
       },
       {"tag": "College Location",
       "patterns": ["Location of the college?",
                    "Address of logmieer",
                    "logmieer location",
                    "kvn addresss",
                    "in which city college are?",
                    "full adress of college"],
       "responses": ["LoGMIEER is Located in famous city which is Nashik, The address is LoGMIEER, Dongare Vasatigruha Parisar , Vasantrao Naik Chowk, Canada Corner, Nashik, Maharashtra 422002 "],
       "context_set": ""
       },
       {"tag": "Cut-off for Computer",
       "patterns": ["What is last year cutoff for computer branch",
                    "cut off score computer branch or engineering",
                    "merit score computer cs",
                    "previous year merit, cutoff of computer engineering",
                    "compter engg last year merit score",
                    "cutoff nad merit last year computer"],
       "responses": ["Last year Cut-off Score on MHT-CET basis for Computer branch is 63 percentile."],
        "context_set": ""
       },
       {"tag": "Cut-off for Mechanical",
       "patterns": ["What is last year cutoff for mechanical branch",
                    "cut off score mechanical branch or engineering",
                    "merit score mechanical",
                    "previous year merit, cutoff of mechanical engineering",
                    "mechanical engineering last year merit score",
                    "cutoff and merit last year mechanical"],
       "responses": ["Last year Cut-off Score on MHT-CET basis for Mechanical branch is 20.44 percentile."],
       "context_set": ""
       },
       {"tag": "Cut-off for AIML",
       "patterns": ["What is last year cutoff for artificial inteligence and machine learning branch",
                    "cut off score aiml branch or engineering",
                    "merit score  for aiml ai artificial inteligence machine learning",
                    "previous year merit, cutoff of machine learning engineering",
                    "aiml engg last year merit score",
                    "cutoff nad merit last year aiml ai ml"],
       "responses": ["Last year Cut-off Score on MHT-CET basis for AIML branch is 48.98 percentile."],
       "context_set": ""
       },
       {"tag": "Cut-off for Electrical",
       "patterns": ["What is last year cutoff for electrical branch",
                    "cut off score electrical branch or engineering",
                    "merit score electrical",
                    "previous year merit, cutoff of electrical engineering",
                    "electrical engg last year merit score",
                    "cutoff and merit last year electrical"],
       "responses": ["Last year Cut-off Score on MHT-CET basis for Electrical branch is 1.5 percentile."],
       "context_set": ""
       },
       {"tag": "Cut-off for Civil",
       "patterns": ["What is last year cutoff for civil branch",
                    "cut off score civil branch or engineering",
                    "merit score civil",
                    "previous year merit, cutoff of civil engineering",
                    "civil engg last year merit score",
                    "cutoff and merit last year civil"],
       "responses": ["Last year Cut-off Score on MHT-CET basis for Civil branch is 3.04 percentile."],
       "context_set": ""
       },       
       {"tag": "Qualifications and background of your faculty",
       "patterns": ["What are the faculty like?",
                    "staff, faculty experience", 
                    "teaching experience of staff, faculty in college", 
                    "faculty, staff information about teaching experience and education of staff", 
                    "What are the qualifications and background of your faculty, staff",
                    "teaching faculty education level or where they from"],
       "responses": ["All the Teachers have Master's Degree in the relevant discipline and an outstanding educational record during their education journey and have very great experience in teaching field.They have variety of skill sets for creating lesson plans, instructing students, working with administrators and interacting with parents. "],
       "context_set": ""
       },       
       {"tag": "College, Institute Infrastructure",
       "patterns": ["Institute Infrastructure",
                    "College Infrastructure",
                    "classroom and practical labs",
                    "internal infrastructure of college and classroom",
                    "clj infrastructure and labs and classroom",
                    "total internal and external infrastructure of college and institute"],
       "responses": ["As a engineering college, we understand the importance of having the latest and best infrastructure, and the role it plays in the academic journey of a student. Our state-of-the-art infrastructure is at par with international standards to ensure that the student is supported and enriched on his way to becoming a highly-skilled engineer"," Our well-planned campus hosts the latest infrastructure facilities. Spacious classrooms, fully equipped with audio visual facilities and learning aids. The building space is standardised as per AICTE norms. We house state-of-the-art laboratories that are constantly upgraded as per international standards to ensure the students have the best technological support. Our library is well maintained with the best of data storage in multimedia and online information. We have thousands of books by renowned authors on all engineering related subjects."],
       "context_set": ""
       },       
       {"tag": "extracurricular activities",
       "patterns": ["What are some typical extracurricular activities?",
                    "extra activities for students provided by institute , college",
                    "extracurricular activities offered by institute , college , clj ",
                    "extra activities for students",
                    "extracurricular activities for students offered by college or institute"],
       "responses": ["Some extracurricular activities are TechFest, Volunteering in NGO’s , internships , debates and discussions , managing events and seminars , setting clubs like for reading, writing , music and painting, competitions and quizzes, learning a new language, and tournaments can prove very fruitful in future for engineering students."],
       "context_set": ""
       },       
       {"tag": "Facilities",
       "patterns": ["What are the different facalities offered by institute for student",
                    "facailities offered to students",
                    "Different facilitiesto students"],
       "responses": ["A college offers all the latest facilities like Hostel, Library, Workshop, Laboratories"],
       "context_set": ""
       },       
       {"tag": "Hostel",
       "patterns": ["Boys Hostel facility, service",
                    "Is hostel facility available for students?",
                    "hostel facility in campus",
                    "residencial facility for student",
                    "hostel service",
                    "hostel in campus",
                    "service for students who are not from nashik city"],
       "responses": ["The Boys Hostel Complex has been built within the campus. Hostel has resident rector to monitor and to maintain the discipline. Hostel rooms are airy, clean and well furnished. Two seater and three seater rooms are available for boys students with R.O. drinking water with cooler, 24 hour Power supply, Wi-Fi Facility in hostel premises, CCTV Install in a hostel"],
       "context_set": ""
       },       
       {"tag": "Library",
       "patterns": ["Central Library facility", 
                    "available books in library",
                    "is college institute provide library facility or any reading section",
                    "facility of books library in institute",
                    "library for students",
                    "does institute provide library facily for students and readibg corner to student"],
       "responses": ["A Central Library of LoGMIEER, provides physical and digital access to different resource materials such as books, periodicals, journals, newspapers, conference proceedings, maps, prints, documents, microfilm, CDs, videotapes, DVDs, e-books, databases and other formats. The reference book section is a separate section in the library which includes the copies of all text books, reference books, project reports, dissertations, thesis and field reports.","The library also includes study zone for students and is open for 12 hours in a day. Dedicated internet facility is available in ten PCs along with the reprographic equipments"],
       "context_set": ""
       },       
       {"tag": "Campus Safety and Security",
       "patterns": ["What kind of on-campus support and safety services are available for students?",
                    "college campus security and safety for students",
                    "students security and safety",
                    "on campus security for boys and girls",
                    "girls security in campus or college campus"],
       "responses": ["Campus security involves the protocols developed by a college to increase on-campus security and prevent crimes. These procedures may include security cameras,  patrolling security guards.Institute provides a comprehensive range of security amenities especially for girls within the premises, through a dedicated team of security personnel"],
       "context_set": ""
       },       
       {"tag": "sports complex or fitness center",
       "patterns": ["Is there a sports complex or fitness center?",
                    "does college pysical education department",
                    "does clj have fitness center or gymkhana",
                    "sport department or gym",
                    "sports department or center in the institute",
                    "physical education and gymkhana in clj or institute",
                    "college gymkhana or gym for physical fitness education"],
       "responses": ["The Sports and Fitness Center has facilities and equipment available for a wide range of athletic interests.he College provides a fitness centre for the purpose of physical exercise. It aims at an all-round development of students"],
       "context_set": ""
       },       
    
       {"tag": "Admission Criteria for fe",
       "patterns": ["whats sis the admission criteria for fe fy ",
                    "aadmission criteria to take admission in first year of engineering",
                    "when i teke admission in engineering",
                    "constraints to take admission in first year",
                    "standards and rules to take admission in engineering"],
       "responses": ["For First Year Engineering student should be Passed HSC or its equivalent examination with Physics and Mathematics as compulsory subjects along with one of the Chemistry or Biology, and obtained at least 45% marks (at least 40% marks, in case of Backward class categories and Persons with Disability candidates belonging to Maharashtra State only) in the above subjects taken together; and Obtained score in MHT-CET or JEE main 2022."],
       "context_set": ""
       },       
       {"tag": "Admission Criteria for DSE",
       "patterns": ["what after i complete my diploma of polytechnic education",
                    "whats is the admission criteria for Direct second year admission in engineering",
                    "aadmission criteria to take admission in second year se of engineering",
                    "when i teke admission in direct second year engineering or after completing my diploma",
                    "constraints to take admission in dse or direct second year , after diploma",
                    "standards and rules to take admission in second year engineering or after diploma"],
       "responses": ["For Direct Second Year Engineering student should be Passed Diploma Course in Engineering and Technology with at least 45% marks (40% marks in case of candidates of backward class categories and Persons with Disability belonging to Maharashtra State only) in appropriate branch of Engineering and Technology from an All India Council for Technical Education or Central or State Government approved Institution or its equivalent."],
       "context_set": ""
       },       
       {"tag": "Admission Process for First Year",
       "patterns": ["what is te admission process for first year engineering admission",
                    "what is the process for first year engineering admission after hsc or twelth",
                    "which process will be follow to take admission in first year engineering",
                    "precess or steps to take admission in engineering",
                    "process or steps for get admitted for first year engineering course or fy or fe",
                    "process or steps to take admission for computer, civil, electrical, meachanical, aiml engineering in first year",
                    "steps for take admission after to fy after twelth or hsc"],
       "responses": ["The whole admission process after entrance exam result consist of following steps respectively that are 1 Online registration, 2 documents upload, 3 Verification of documents at confirmation of application form, 4 Display of final merit list, 5 CAP Round 1 2 3- Online Submission & Confirmation of Option Entry And Accepting Seat, 6 Online Self-Reporting and Download of Allotment Letter, 7 Physical Reporting at Allotted Institute."],
       "context_set": ""
       },       
       {"tag": "Admission Process for Direct Second Year",
       "patterns": ["what is te admission process for direct second year engineering admission",
                    "what is the process for second year engineering admission after diploma or polytechnic",
                    "which process will be follow to take admission in second year engineering after diploma or polytechnic",
                    "precess or steps to take admission in engineering second year",
                    "process or steps for get admitted for second year engineering course or sy or se",
                    "process or steps to take admission for computer, civil, electrical, meachanical, aiml engineering in second year",
                    "steps for take admission after diploma or polytechnic to sy or dse"],
       "responses": ["The whole admission process after passing diploma and entrance exam result consist of following steps respectively that are 1 Online registration, 2 documents upload, 3 Verification of documents at confirmation of application form, 4 Display of final merit list, 5 CAP Round 1 2 3- Online Submission & Confirmation of Option Entry And Accepting Seat, 6 Online Self-Reporting and Download of Allotment Letter, 7 Physical Reporting at Allotted Institute."],
       "context_set": ""
       },       
       {"tag": "Documents For First Year Admission",
       "patterns": ["what are the documents required for first year admission",
                    "which documents are essential for taking admission in engineering first year",
                    "documents for taking admission in fy or first year engineering",
                    "which documents are required to confirm my admission in engineering course"],
       "responses": ["Documents Required For First Year Admission are Allotment letter of CAP admission, MHT-CET or JEE Score Card, SSC and HSC Marksheet, Leaving Certificate, Migration Certificate for other than Maharashtra HSC Board student, Domicile and Nationality certificate, Caste Certificate If applicable, Caste Validity Certificate If applicable, Non Creamy layer Certificate If applicable, Income certificate of Parents, Photographs, Aadhar Card Xerox Copy"],
       "context_set": ""
       },       
       {"tag": "Documents For Second Year Admission",
       "patterns": ["what are the documents required for direct second year admission or afyer diploma admission",
                    "which documents are essential for taking admission in engineering second year",
                    "documents for taking admission in sy or second year engineering",
                    "which documents are required to confirm my admission in second year engineering course"],
       "responses": ["Documents Required For Second Year Admission are Allotment letter of CAP admission, Diploma Marksheet, MHT-CET or JEE Score Card, SSC and HSC Marksheet, Leaving Certificate, Migration Certificate for other than Maharashtra HSC Board student, Domicile and Nationality certificate, Caste Certificate If applicable, Caste Validity Certificate If applicable, Non Creamy layer Certificate If applicable, Income certificate of Parents, Photographs, Aadhar Card Xerox Copy"],
       "context_set": ""
       }

   ]
}


